CFD Projects/serpentine_cooling_CFD_project/serpentine_cooling/case_Re1000/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - g (gravitational acceleration)
  Required by buoyantSimpleFoam
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];

value           (0 -9.81 0);    // gravity acts in -y direction
