CFD Projects/serpentine_cooling_CFD_project/serpentine_cooling/case_Re1000/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - Temperature boundary conditions
  T_inlet  = 300 K (cool water entering)
  T_hotWall = 350 K (heated bottom wall, constant temperature)
  T_coldWall: zeroGradient (insulated top wall)
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;    // 300 K = 27°C inlet water temperature
    }

    outlet
    {
        type            zeroGradient;
    }

    hotWall
    {
        type            fixedValue;
        value           uniform 350;    // 350 K = 77°C hot wall (constant Tw)
    }

    coldWall
    {
        type            zeroGradient;   // Insulated (adiabatic) top wall
    }

    frontAndBack
    {
        type            empty;
    }
}
